Revit 2024 API
DWGExportOptions Class
 The export options used by exporting DWG format file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class DWGExportOptions : ACADExportOptions
Visual Basic
Public Class DWGExportOptions _
	Inherits ACADExportOptions
Visual C++
public ref class DWGExportOptions : public ACADExportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseExportOptions
 Autodesk.Revit.DB.ACADExportOptions
 Autodesk.Revit.DB.DWGExportOptions
See Also
DWGExportOptions Members
Autodesk.Revit.DB Namespace